Mikhail-Za/DualMesh-Boot-Launcher-for-LilyGo-T-Display-P4/launcher/sdkconfig.defaults
# T-Display P4 ships ESP32-P4 rev v1.0 silicon — pre-v3 and v3+ are mutually
# exclusive build targets. Without these two lines the binary refuses to flash/boot.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_dualmesh.csv"

# Match the flash mode/freq of the stock MeshOS image header (DIO @ 80MHz)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Factory slot is 896KB — optimize for size
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Factory-reset escape hatch: after a reset, hold BOOT (GPIO35) ~2s -> bootloader
# erases otadata and boots the launcher. DATA_FACTORY_RESET is explicitly EMPTY:
# the IDF default is "nvs", which would wipe the MeshOS license cache + config.
CONFIG_BOOTLOADER_FACTORY_RESET=y
CONFIG_BOOTLOADER_NUM_PIN_FACTORY_RESET=35
CONFIG_BOOTLOADER_FACTORY_RESET_PIN_LOW=y
CONFIG_BOOTLOADER_OTA_DATA_ERASE=y
CONFIG_BOOTLOADER_DATA_FACTORY_RESET=""
CONFIG_BOOTLOADER_HOLD_TIME_GPIO=2

# LilyGo device driver: T-Display P4 board, info logging
CONFIG_LILYGO_DEVICE_DRIVER_T_DISPLAY_P4=y
CONFIG_CPP_BUS_DRIVER_LOG_LEVEL_INFO=y
CONFIG_LILYGO_DEVICE_DRIVER_LOG_LEVEL_INFO=y

# 32MB PSRAM (hex mode @200MHz) — LVGL draw buffer lives here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

CONFIG_FREERTOS_HZ=1000

# SD card: FAT32 with long filenames
CONFIG_FATFS_LFN_HEAP=y

# LVGL
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_DEF_REFR_PERIOD=10
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_20=y
